---
kind: type
id: T:Autodesk.Revit.DB.DocumentSet
source: html/e1951076-29d2-4817-18d9-a01847fa812a.htm
---
# Autodesk.Revit.DB.DocumentSet

A set that can contain any documents.

## Syntax (C#)
```csharp
public class DocumentSet : APIObject,
	IEnumerable
```